bootcamp/mini-curso-testes/app/controllers/weapons_controller.rb

  def set_weapons_params
    @weapon = Weapon.find(params[:id])
---
SELECT  "weapons".* FROM "weapons" WHERE "weapons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]