bootcamp/Rails_basic_module_2/app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Samwell Tarly"], ["created_at", "2019-05-21 13:59:06.735188"], ["updated_at", "2019-05-21 13:59:06.735188"]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def edit
    @contact = Contact.find(params[:id])

UPDATE "contacts" SET "name" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["name", "Shallow Now 2"], ["updated_at", "2019-05-21 13:33:41.133677"], ["id", 7]]
---
  def update
    if @contact.update(contact_params)